test/Malle/LES/diff_4species/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    jetInlet
    {
        type    calculated;
        value   uniform 0;
    }

    coflowInletBottom
    {
        type    calculated;
        value   uniform 0;
    }

    coflowInletTop
    {
        type    calculated;
        value   uniform 0;
    }

    outlet
    {
        type    calculated;
        value   uniform 0;
    }

    bottomWall
    {
        type    nutUSpaldingWallFunction;
        value   uniform 0;
    }

    topWall
    {
        type    nutUSpaldingWallFunction;
        value   uniform 0;
    }

    front
    {
        type    cyclic;
    }

    back
    {
        type    cyclic;
    }
}


// ************************************************************************* //
