test/Malle/LES/diff_4species/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
 *    H2   0
   H    0
   O2   0.1148186
   O    0
   OH   0
   HO2  0
   H2O2 0
   H2O  0.1292854
   N2   0.7558961


               */
    //volScalarFieldValue T    300.
defaultFieldValues
(
    volScalarFieldValue T    1646.5095081054
    volScalarFieldValue N2   0.7558961
    volScalarFieldValue H2   0.
    volScalarFieldValue H2O  0.1292854
    volScalarFieldValue O2   0.1148186
);

regions
(
 /*
    boxToCell
    {
        box (0 -10 -100) (0.0036 10 0);
        fieldValues
        (
            volScalarFieldValue CH4 0.1561
            volScalarFieldValue O2 0.1966
            volScalarFieldValue N2 0.6473
        );
    }
 */
);

// ************************************************************************* //
